# Homebrew Bundle
# https://github.com/Homebrew/homebrew-bundle

# ------------------------------------------------------------------------------
# CLI Tools
# ------------------------------------------------------------------------------
brew "git"
brew "zsh"
brew "zsh-completions"
# brew "node"
brew "sheldon"
brew "coreutils"
brew "tree"
brew "lsd"
brew "wget"
#brew "yarn"
brew "tldr"
brew "mas"
brew "gh"
brew "terminal-notifier"
#brew "youtube-dl"
brew "openssl@3"
brew "readline"
brew "sqlite3"
brew "xz"
brew "zlib"
brew "tcl-tk"
#brew "autoconf"
#brew "automake"
#brew "libtool"
brew "texlive"
#brew "perl"
brew "pandoc-crossref"
brew "pandoc"
brew "php"
#brew "librsvg"
brew "pyenv"
brew "pyenv-virtualenv"


# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------
tap "homebrew/cask-fonts"

# ------------------------------------------------------------------------------
# Cask
# ------------------------------------------------------------------------------

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"

# Utils
cask "gpg-suite"
#cask "openvpn-connect"

# Media
# cask "transmission"
cask "handbrake"
cask "vlc"

# Development
cask "iterm2"
cask "github"
cask "fig"
cask "vscodium"

# Desktop applications
cask "telegram"
cask "firefox"
cask "dropbox"
cask "slack"
cask "steam"
cask "spotify"
cask "discord"
cask "tradingview"
cask "latexit"
cask "mactex"

# Quick Look plugins
cask "qlcolorcode" # https://github.com/anthonygelibert/QLColorCode
cask "qlstephen" # https://github.com/whomwah/qlstephen
cask "quicklook-json" # https://github.com/sindresorhus/quick-look-plugins
cask "qlimagesize" # https://github.com/Nyx0uf/qlImageSize
cask "webpquicklook" # https://github.com/dchest/webp-quicklook

# ------------------------------------------------------------------------------
# App Store applications
# ------------------------------------------------------------------------------
mas "Spark", id: 1176895641
mas "Unsplash Wallpapers", id: 1284863847
mas "NordVPN", id: 905953485
mas "The Unarchiver",  id: 425424353
mas "Magnet", id: 441258766
mas "Moleskine Overlap", id: 1516950324
mas "Journey", id: 1489704689
mas "Timepage", id: 989178902
mas "CotEditor", id: 1024640650
mas "SnippetsLab", id: 1006087419
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Python Recipes", id: 1180825853
mas "Pomo Done – Your Time Hacker", id: 1096128050
mas "Transmit 5", id: 1436522307
mas "PDF Expert – Edit, Sign PDFs", id: 1055273043
mas "Owly - Prevent Display Sleep", id: 882812218
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "Numbers" id: 409203825
mas "MindNode – Mind Map & Outline" id: 1289197285
