# Homebrew Bundle
# https://github.com/Homebrew/homebrew-bundle

# ------------------------------------------------------------------------------
# CLI Tools
# ------------------------------------------------------------------------------
brew "git"
brew "zsh"
brew "zsh-completions"
brew "node"
brew "sheldon"
brew "coreutils"
brew "nvm"
brew "tree"
brew "lsd"
brew "wget"
brew "yarn"
brew "tldr"
brew "mas"
brew "gh"
brew "terminal-notifier"
# brew "wifi-password"
# brew "speedtest"
# brew "bat"
# brew "trash-it"
brew "youtube-dl"
brew "openssl@3"
brew "pyenv"
brew "autoconf"
brew "automake"
brew "libtool"
brew "gettext"
brew "texlive"
brew "perl"
brew "pandoc-ref"
brew "pandoc"
brew "librsvg"
brew "entr"

# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------
tap "homebrew/cask-fonts"

# ------------------------------------------------------------------------------
# Cask
# ------------------------------------------------------------------------------

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"

# Utils
cask "gpg-suite"
cask "openvpn-connect"

# Media
cask "transmission"
cask "handbrake"
cask "vlc"
cask "obs"

# Development
cask "atom"
cask "iterm2"
cask "visual-studio-code"
cask "github"
cask "fig"
cask "vscodium"

# Desktop applications
cask "telegram"
cask "google-chrome"
cask "firefox"
cask "dropbox"
cask "slack"
cask "steam"
cask "spotify"
cask "notion"
cask "discord"
cask "tradingview"
cask "latexit"
cask "zettlr"
cask "mactex"

# Quick Look plugins
cask "qlcolorcode" # https://github.com/anthonygelibert/QLColorCode
cask "qlstephen" # https://github.com/whomwah/qlstephen
cask "quicklook-json" # https://github.com/sindresorhus/quick-look-plugins
cask "qlimagesize" # https://github.com/Nyx0uf/qlImageSize
cask "webpquicklook" # https://github.com/dchest/webp-quicklook

# ------------------------------------------------------------------------------
# App Store applications
# ------------------------------------------------------------------------------
mas "Spark", id: 1176895641
mas "Unsplash Wallpapers", id: 1284863847
mas "NordVPN", id: 905953485
mas "The Unarchiver",  id: 425424353
mas "1Password 7", id: 1333542190
mas "Magnet", id: 441258766
mas "Moleskine Overlap", id: 1516950324
mas "Journey", id: 1489704689
mas "Timepage", id: 989178902
mas "CotEditor", id: 1024640650
mas "SnippetsLab", id: 1006087419
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Python Recipes", id: 1180825853
mas "Pomo Done – Your Time Hacker", id: 1096128050
mas "Be Focused - Focus Timer", id: 973134470
